FundyLab/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# FundyLab plain SAMD21 (SAMD21)
# -----------------------------------
fundylab_plain_samd21.name=FundyLab plain SAMD21 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
fundylab_plain_samd21.vid.0=0x22EA
fundylab_plain_samd21.pid.0=0x0000
fundylab_plain_samd21.vid.1=0x22EA
fundylab_plain_samd21.pid.1=0x0000

# Upload
fundylab_plain_samd21.upload.tool=bossac18
fundylab_plain_samd21.upload.protocol=sam-ba
fundylab_plain_samd21.upload.maximum_size=262144
fundylab_plain_samd21.upload.offset=0x2000
fundylab_plain_samd21.upload.use_1200bps_touch=true
fundylab_plain_samd21.upload.wait_for_upload_port=true
fundylab_plain_samd21.upload.native_usb=true

# Build
fundylab_plain_samd21.build.mcu=cortex-m0plus
fundylab_plain_samd21.build.f_cpu=48000000L
fundylab_plain_samd21.build.usb_product="plain SAMD21"
fundylab_plain_samd21.build.usb_manufacturer="FundyLab"
fundylab_plain_samd21.build.board=FUNDYLAB_PLAIN_SAMD21
fundylab_plain_samd21.build.core=arduino
fundylab_plain_samd21.build.extra_flags=-D__SAMD21G18A__ -DFUNDYLAB_PLAIN_SAMD21 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
fundylab_plain_samd21.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
fundylab_plain_samd21.build.openocdscript=scripts/openocd/daplink_samd21.cfg
fundylab_plain_samd21.build.variant=plain_samd21
fundylab_plain_samd21.build.variant_system_lib=
fundylab_plain_samd21.build.vid=0x22EA
fundylab_plain_samd21.build.pid=0x0000
fundylab_plain_samd21.bootloader.tool=openocd
fundylab_plain_samd21.bootloader.file=plain_samd21/flplain_samd21_sam_ba.bin

# Menu: Optimization
fundylab_plain_samd21.menu.opt.small=Small (-Os) (standard)
fundylab_plain_samd21.menu.opt.small.build.flags.optimize=-Os
fundylab_plain_samd21.menu.opt.fast=Fast (-O2)
fundylab_plain_samd21.menu.opt.fast.build.flags.optimize=-O2
fundylab_plain_samd21.menu.opt.faster=Faster (-O3)
fundylab_plain_samd21.menu.opt.faster.build.flags.optimize=-O3
fundylab_plain_samd21.menu.opt.fastest=Fastest (-Ofast)
fundylab_plain_samd21.menu.opt.fastest.build.flags.optimize=-Ofast
fundylab_plain_samd21.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
fundylab_plain_samd21.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
fundylab_plain_samd21.menu.usbstack.arduino=Arduino
fundylab_plain_samd21.menu.usbstack.tinyusb=TinyUSB
fundylab_plain_samd21.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
fundylab_plain_samd21.menu.debug.off=Off
fundylab_plain_samd21.menu.debug.on=On
fundylab_plain_samd21.menu.debug.on.build.flags.debug=-g
